Vue.component('user-menu',{
    template:`
        <ul class="main-menu-container">
            <li v-for="item in this.menu" :id='item.name' v-bind:class="{ active: item.isActive }">
                <span class="menu-item-icon" v-html="item.svg">

                </span>
                <span class="menu-item-title">
                    <a :href="item.link" class="non-dec white p-like">{{item.title}}</a>
                </span>
            </li>
            <li>
                <span class="menu-item-icon">
                    <svg xmlns="http://www.w3.org/2000/svg" width="20.999" height="21" viewBox="0 0 20.999 21">
                        <path id="exit" d="M15.307,16.078v1.641A3.285,3.285,0,0,1,12.025,21H3.781A3.285,3.285,0,0,1,.5,17.719V3.281A3.285,3.285,0,0,1,3.781,0h8.244a3.285,3.285,0,0,1,3.281,3.281V4.922a.82.82,0,0,1-1.641,0V3.281a1.643,1.643,0,0,0-1.641-1.641H3.781A1.643,1.643,0,0,0,2.141,3.281V17.719a1.643,1.643,0,0,0,1.641,1.641h8.244a1.643,1.643,0,0,0,1.641-1.641V16.078a.82.82,0,0,1,1.641,0ZM20.9,9.091,19.062,7.254a.82.82,0,1,0-1.16,1.16l1.307,1.307H9.359a.82.82,0,1,0,0,1.641h9.85L17.9,12.668a.82.82,0,1,0,1.16,1.16L20.9,11.991a2.053,2.053,0,0,0,0-2.9Zm0,0" transform="translate(-0.5)" />
                    </svg>
                </span>
                <span class="menu-item-title">
                    <a href="http://${window.location.host}/logout" class="non-dec white p-like">Вихід</a>
                </span>
            </li>
        </ul>
    `,
    data(){
        return{
            menu:[
                {
                    "name":"home",
                    "isActive":false,
                    "link":`http://${window.location.host}/dashboard/home`,
                    "title":"Домашня сторінка",
                    "svg":'<svg xmlns="http://www.w3.org/2000/svg" width="19.778" height="19.78" viewBox="0 0 19.778 19.78"><path id="home_1_" data-name="home (1)" d="M19.746,8.6l0,0L11.676.533A1.821,1.821,0,0,0,9.1.533L1.037,8.6l-.008.008a1.82,1.82,0,0,0,1.212,3.1l.056,0h.321v5.938a2.134,2.134,0,0,0,2.131,2.131H7.906a.58.58,0,0,0,.579-.579V14.544a.973.973,0,0,1,.972-.972H11.32a.973.973,0,0,1,.972.972V19.2a.58.58,0,0,0,.579.579h3.157a2.134,2.134,0,0,0,2.131-2.131V11.71h.3A1.821,1.821,0,0,0,19.746,8.6Zm-.821,1.755a.658.658,0,0,1-.468.194H17.58a.579.579,0,0,0-.579.579v6.517a.973.973,0,0,1-.972.972H13.451V14.544a2.134,2.134,0,0,0-2.131-2.131H9.458a2.134,2.134,0,0,0-2.131,2.131V18.62H4.749a.973.973,0,0,1-.972-.972V11.131a.579.579,0,0,0-.579-.579h-.89a.661.661,0,0,1-.456-1.129h0L9.921,1.352a.662.662,0,0,1,.936,0l8.066,8.066,0,0a.663.663,0,0,1,0,.935Zm0,0" transform="translate(-0.5 0.001)" /></svg>'
                },
                {
                    "name":"study",
                    "isActive":false,
                    "link":`http://${window.location.host}/dashboard/study`,
                    "title":"Навчальні матеріали",
                    "svg":'<svg xmlns="http://www.w3.org/2000/svg" width="28.308" height="21" viewBox="0 0 28.308 21"><g id="graduate-cap" transform="translate(0 -61.572)"><path id="Path_416" data-name="Path 416" d="M.42,70.042l4.225,2.035v3.388a.742.742,0,0,0,.42.668l8.082,3.893a.743.743,0,0,0,.322.073h1.358a.743.743,0,0,0,.322-.073l8.06-3.883a.742.742,0,0,0,.353-.361l.029-.067a.742.742,0,0,0,.06-.291V72.077l1.152-.555v4.594a1.329,1.329,0,0,0-.535.719l-.656,2.137a1.33,1.33,0,0,0,.006.8l.608,1.874a1.338,1.338,0,0,0,1.229.923H25.5a1.328,1.328,0,0,0,1.242-.846l.7-1.785a1.341,1.341,0,0,0,.039-.867l-.656-2.226a1.328,1.328,0,0,0-.539-.734V70.807l1.6-.771a.742.742,0,0,0,.42-.668v-.591a.742.742,0,0,0-.42-.668L14.47,61.645a.742.742,0,0,0-.644,0L.42,68.1a.742.742,0,0,0-.42.668v.6A.742.742,0,0,0,.42,70.042ZM25.512,80.8l-.466-1.436.5-1.62.5,1.7ZM22.168,75l-7.51,3.618H13.638L6.128,75V72.792l7.7,3.708a.742.742,0,0,0,.644,0l7.7-3.708V75Zm-8.02-11.862L26.47,69.072,22.686,70.9a.748.748,0,0,0-.1.038L14.148,75l-8.44-4.065a.746.746,0,0,0-.1-.038L1.826,69.072Z" transform="translate(0 0)"/></g></svg>'
                },
                {
                    "name":"activity",
                    "isActive":false,
                    "link":`http://${window.location.host}/dashboard/activity`,
                    "title":"Моя активність",
                    "svg":'<svg xmlns="http://www.w3.org/2000/svg" width="22" height="21.083" viewBox="0 0 22 21.083"><g id="business-and-finance" transform="translate(0 -1)"><path id="Path_417" data-name="Path 417" d="M21.542,23.917H.458a.458.458,0,0,1,0-.917H21.542a.458.458,0,1,1,0,.917Z" transform="translate(0 -1.833)" fill="#fff"/><path id="Path_418" data-name="Path 418" d="M6.042,23.417H1.458A.458.458,0,0,1,1,22.958V17.917A.918.918,0,0,1,1.917,17H5.583a.918.918,0,0,1,.917.917v5.042A.458.458,0,0,1,6.042,23.417ZM1.917,22.5H5.583V17.917H1.917Z" transform="translate(-0.083 -1.333)" /><path id="Path_419" data-name="Path 419" d="M14.042,22.917H9.458A.459.459,0,0,1,9,22.458V11.917A.918.918,0,0,1,9.917,11h3.667a.918.918,0,0,1,.917.917V22.458A.459.459,0,0,1,14.042,22.917ZM9.917,22h3.667V11.917H9.917Z" transform="translate(-0.75 -0.833)" /><path id="Path_420" data-name="Path 420" d="M22.042,22.417H17.458A.459.459,0,0,1,17,21.958V5.917A.918.918,0,0,1,17.917,5h3.667a.918.918,0,0,1,.917.917V21.958A.458.458,0,0,1,22.042,22.417ZM17.917,21.5h3.667V5.917H17.917Z" transform="translate(-1.417 -0.333)" /><path id="Path_421" data-name="Path 421" d="M2.458,10.167a.458.458,0,0,1-.324-.782l8.25-8.25a.458.458,0,0,1,.648.648l-8.25,8.25a.457.457,0,0,1-.324.134Z" transform="translate(-0.167 0)" /><path id="Path_422" data-name="Path 422" d="M11.125,5.583a.459.459,0,0,1-.458-.458V1.917H7.458a.458.458,0,1,1,0-.917h3.667a.458.458,0,0,1,.458.458V5.125A.458.458,0,0,1,11.125,5.583Z" transform="translate(-0.583 0)" /></g></svg>'
                },
                {
                    "name":"settings",
                    "isActive":false,
                    "link":`http://${window.location.host}/dashboard/settings`,
                    "title":"Налаштування",
                    "svg":'<svg xmlns="http://www.w3.org/2000/svg" width="20.999" height="21" viewBox="0 0 20.999 21"> <path id="exit" d="M15.307,16.078v1.641A3.285,3.285,0,0,1,12.025,21H3.781A3.285,3.285,0,0,1,.5,17.719V3.281A3.285,3.285,0,0,1,3.781,0h8.244a3.285,3.285,0,0,1,3.281,3.281V4.922a.82.82,0,0,1-1.641,0V3.281a1.643,1.643,0,0,0-1.641-1.641H3.781A1.643,1.643,0,0,0,2.141,3.281V17.719a1.643,1.643,0,0,0,1.641,1.641h8.244a1.643,1.643,0,0,0,1.641-1.641V16.078a.82.82,0,0,1,1.641,0ZM20.9,9.091,19.062,7.254a.82.82,0,1,0-1.16,1.16l1.307,1.307H9.359a.82.82,0,1,0,0,1.641h9.85L17.9,12.668a.82.82,0,1,0,1.16,1.16L20.9,11.991a2.053,2.053,0,0,0,0-2.9Zm0,0" transform="translate(-0.5)" /> </svg>'
                }
            ],
        }
    },
    mounted(){
        let pathName = window.location.pathname.split("/")[2]; // get current page name
        this.menu.forEach(element => {
            if(element.name == pathName) // add active class to menu item
                element.isActive = true;
        });
    }
})